tutorials/CFD/06POD_RBF_multiDirVis/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.001;
        smoother        GaussSeidel;
    }
    /*p
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0.01;
        preconditioner  DIC;
    }*/

    

    /*"(k|epsilon|omega|f|v2|nuTilda)"
    {
	solver	PBiCG;
	preconditioner DILU;
	tolerance 1e-7;
	relTol 	  0.1;
    }*/
    "(U|k|epsilon|omega|f|v2|nuTilda)"
    {
	solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
	Usup
    {
	type            coupled;  // optional, defaults to segregated
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }	
    Phi
    {
        $p;
    }
}
potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

SIMPLE
{
    nNonOrthogonalCorrectors 4;
    consistent      yes;
}

relaxationFactors
{
    fields
    {
	p	0.7;
    }
    equations
    {
        U               0.9; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
